Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: སྲོག་ཆགས་རྣམས་ལ་ཕན་ཕྱིར་བྱང་ཆུབ་ཚོལ། །
en: I come in search of awakening for the benefit of living beings.

source: སྲོག་ཆགས་སྟོང་པོ་འདི་དང་ལྷན་ཅིག་ཏུ། །སངས་རྒྱས་དང་ནི་ཚོགས་ལ་སྐྱབས་སུ་མཆི། །
en: Together with these thousands of beings, I go for refuge to the Buddha and his assembly.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་སེམས་ཅན་ཇི་སྙེད་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་གན་དུ་མཆིས་པ་དེ་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་ལགས་ན། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་མི་འགྱུར་བ་དང་། བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ལས་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་གང་ལགས་པ་དགེ་བའི་རྩ་བ་འདིས་བདག་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ལྟར་དེ་དག་ལ་ཆོས་བསྟན་དུ་གསོལ། འདི་ལྟ་སྟེ་ད་ལྟར་བཅོམ་ལྡན་འདས་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཆོས་འདི་དག་ཐོབ་པར་གྱུར་ཅིག །
en: After the merchant Naradatta had praised the Lord with these verses, he then said to the Lord, “Lord, all of us, myself and this great number of sentient beings, have come to seek an audience with the Lord so that we can set out for unsurpassed perfect awakening. Lord, please teach them the kind of Dharma that they need in order to all be set irreversibly on their way to unsurpassed perfect awakening. Please tell me, Lord, what kinds of roots of virtue I should cultivate before the Lord, what kinds of roots of virtue I will need to attain unsurpassed perfect awakening. May all sentient beings here and now gain access to the kinds of qualities that the Lord possesses.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་དང་། སྐྱེ་དགུའི་བདག་མོ་བདུན་པོ་དེ་དག་དང་། ཁྱེའུ་བདུན་དང་། བུ་མོ་བདུན་དང་། བྲན་ཕོ་བདུན་དང་། བྲན་མོ་བདུན་དང་། སྲོག་ཆགས་ཁྲི་བོ་དེ་དག་དང་རོལ་མོ་མཁན་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བདག་ཅག་སངས་རྒྱས་དང་། ཆོས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ། དེང་ནས་ཇི་སྲིད་འཚོ་བའི་བར་དུ་སྲོག་གཅོད་པ་སྤོང་ངོ་། ། སྐྱབས་སུ་མཆིས་སོ། ། མངོན་པར་དད་དོ། ། བཅོམ་ལྡན་འདས་བདག་ཅག་དེང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ། ། འདི་ལྟ་སྟེ། ད་ལྟར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཁྱོད་བཞིན་དུ་བདག་ཅག་ཀྱང་། བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་བགྱིའོ། ། འདི་ལྟ་སྟེ། ད་ལྟར་བཅོམ་ལྡན་འདས་ཚོགས་ལ་གདམས་ངག་མཛད་པ་དེ་བཞིན་དུ་ཚོགས་ལ་གདམས་པར་བགྱིའོ། ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ད་ལྟར་བཅོམ་ལྡན་འདས་སེམས་ཅན་སྡུག་བསྔལ་གྱིས་ཉེན་པ་རྣམས་ཐར་བར་མཛད་པ་དེ་བཞིན་དུ་བདག་ཅག་ཀྱང་སེམས་ཅན་སྡུག་བསྔལ་གྱིས་ཉེན་པ་རྣམས་ཐར་བར་བགྱིའོ། །
en: Then the merchant Naradatta’s seven wives, seven sons, seven daughters, seven male servants, and seven female servants, the ten thousand beings who had followed him from the city, and the five hundred musicians that were there addressed the Lord: “Lord, we go for refuge to the Buddha, the Dharma, and the Saṅgha of mendicants. May the Lord accept us as lay followers. From this day forth, for as long as we live, we will abstain from taking life, we will go for refuge, and we will remain filled with devotion. From this day forth, Lord, we will maintain our commitment to unsurpassed perfect awakening. Just as you have become perfectly awakened, we, too, will attain unsurpassed perfect awakening and teach the Dharma to sentient beings. Just as the Lord now guides his followers, we shall guide our followers. Just as the Lord is now liberating sentient beings from the oppression of suffering, we will liberate sentient beings from the oppression of suffering.”

source: དེ་ནས་རོལ་མོ་མཁན་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སིལ་སྙན་གྱི་སྒྲ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་སྐོར་བ་བྱེད་དོ། ། སྲོག་ཆགས་ཁྲི་བོ་དེ་དག་དང་། ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་ཆུང་མ་བདུན་དང་། ཁྱེའུ་བདུན་དང་། བུ་མོ་བདུན་དང་། བྲན་ཕོ་བདུན་དང་། བྲན་མོ་བདུན་དང་། གཡོག་ཐམས་ཅད་དང་། རོལ་མོ་མཁན་ལྔ་བརྒྱ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་སྐོར་བ་བྱེད་དོ། །
en: The five hundred musicians then circumambulated the Lord three times while they played their instruments with great enthusiasm. The ten thousand beings who had come from the city, along with the merchant Naradatta and his whole following—his seven wives, his seven sons, his seven daughters, his seven male servants, and his seven female servants, and the five hundred musicians—circumambulated the Lord three times.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སེམས་ཅན་དེ་དག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་སྟེང་གི་བར་སྣང་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་སོ། ། དེ་ནས་རོལ་མོ་མཁན་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་སྟེང་གི་བར་སྣང་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་པ་མཐོང་ངོ་། ། མཐོང་ནས་ ཀྱང་དད་པ་སྐྱེས་ནས་ སངས་རྒྱས་ཀྱི་མཐུས་རོལ་མོའི་ཆ་སྤྱད་དེ་དག་ཐམས་ཅད་བོར་བ་དང་། སངས་རྒྱས་ཀྱི་མཐུས་དེ་དག་མ་བཟུང་བར་སྟེང་གི་བར་སྣང་ལ་གནས་ཤིང་སྒྲ་འབྱིན་ཏེ སྒྲ་འབྱིན་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་བར་སྣང་ལ་བཞུགས་པ་ལ་ལན་གསུམ་སྐོར་བ་བྱེད་དོ། །
en: Then the Lord, because of his empathy for these sentient beings, took his seat on a throne that was floating in the sky. The five hundred musicians saw the Lord taking his seat on the throne floating in the sky, and when they saw this, they developed faith, right there in the presence of the Lord. Through the power of the Buddha they dropped all the instruments they were holding, and through the power of the Buddha these remained suspended in midair without missing a note. As they played, the instruments circumambulated the Buddha three times while he was seated in midair.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་གཡོག་དང་བཅས་པ་དང་། རོལ་མོ་མཁན་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་དང་། སྲོག་ཆགས་ཁྲི་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་འདི་མཐོང་ནས་ དགའ་མགུ་ཡི་རངས་ཏེ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་ ཐམས་ཅད་ཐལ་མོ་སྦྱར་ཏེ བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ལོ། ། སྟེང་གི་བར་སྣང་ལ་དཔག་ཚད་གཅིག་ཁོར་ཡུག་ཏུ་ཡང་སིལ་སྙན་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་མ་བཟུང་བདག་གིས་ཁྱབ་པར་གྱུར་ཏེ། དཔེར་ན་སྦྲང་རྩིའི་སྦྲང་མའི་ཚང་བཞིན་དུ་སྟེང་གི་བར་སྣང་ལ་རྔ་དང་རོལ་མོ་སིལ་སྙན་གྱི་སྒྲ་བྱུང་ངོ་། །
en: The merchant’s son Naradatta, along with his servants, the five hundred musicians, and the ten thousand beings from the city, witnessed this miracle, this display of magical ability, and when they saw it they were happy, they were thrilled, joy arose in them, and they all folded their hands in honor of the Lord. The space around them was filled with the spontaneous sounds of thousands of instruments as far as a yojana away, and the sound of these drums and cymbals was like a swarm of honeybees.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་གཡོག་དང་བཅས་པ་དང་། རོལ་མོ་མཁན་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་དང་། སྲོག་ཆགས་ཁྲི་བོ་དེ་དག་དང་། ཆོས་ཉན་དུ་སྔར་ལྷགས་པ་ལས་སྲོག་ཆགས་དྲུག་སྟོང་ཙམ་ཞིག་དང་། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་མཐུས་སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་པ་དང་། སངས་རྒྱས་ཀྱི་མཐུས་སྟེང་གི་བར་སྣང་ལ་ཁང་པ་བརྩེགས་པ་ལྔ་ལྔ་བྱུང་ངོ་། ། རོལ་མོ་མཁན་གྱི་ཁང་པ་བརྩེགས་པ་བཞིས་མདུན་གྱིས་བལྟས་པའི་རོལ་མོ་མཁན་གྱི་ཁང་པ་བརྩེགས་པ་ཐམས་ཅད་ན་ཆོས་སྟོན་ཏོ། ། བར་སྣང་ལ་གནས་པའི་ལྷ་སྟོང་ཕྲག་བྱེ་བ་དུ་མ་དག་གིས་ཀྱང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་གཏོར་ཏོ། ། མེ་ཏོག་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་སྟེང་གི་བར་སྣང་ལ་ཁང་པ་བརྩེགས་པ་བརྒྱད་ཅུར་གྱུར་ཏོ། །
en: In addition to the merchant’s son Naradatta, his servants, the five hundred musicians, and the ten thousand beings from the city who were already there listening to the Dharma, there were six thousand other beings and one thousand two hundred fifty mendicants there, and through the power of the Buddha they all rose up into the sky, and through the power of the Buddha, five five-tiered pavilions appeared in the sky. The Dharma was then taught in all the pavilions of musicians arranged in the four surrounding tiered pavilions. There were many thousands of gods floating in the air showering them with divine mandārava flowers, and through the power of the Buddha, these flowers were transformed into eighty pavilions.

source: དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་སྟེང་གི་བར་སྣང་ལ་གནས་པས་རྫུ་འཕྲུལ་གྱི་མཐུ་ཆེན་པོ་འདི་མཐོང་ནས་ བཅོམ་ལྡན་འདས་ལ་དགའ་བ་དང་། དད་པ་དང་། གུས་པ་དང་། ཞེས་ཆེར་བྱེད་དོ། ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོའི་དད་པ་མཁྱེན། ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་དང་། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེའི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་དེའི་ཚེ་འཛུམ་པ་མཛད་དེ། དབུའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཞེས་བྱ་བའི་བར་དུ་རྒྱས་པར་སྦྱར་རོ། །
en: As the great host of beings who were suspended in midair witnessed this great and powerful display of magical abilities, their joy, their faith, and their respect for the Lord became even greater. The Lord was aware of the faith possessed by the great host of beings, and when he saw the excellent motivation of the merchant’s son Naradatta and the great host of beings, he then smiled, and so forth. The previous section ending in “and dissolved into the crown of his head” can be inserted here.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་མཐོང་ནས་ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ནི་རྒྱུ་མ་མཆིས། རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན་ འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: When the venerable Ānanda saw that the Lord was smiling, he placed his robe over one shoulder, joined his hands in reverence facing in the direction of the Lord, and asked the Lord, “Lord, the lords, the buddhas, do not smile without a reason, without a particular cause. What is the reason for this smile? What is the cause of this smile?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། ཀུན་དགའ་བོ་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་འདིས་ཆུང་མ་བདུན་དང་། ཁྱེའུ་བདུན་དང་། བུ་མོ་བདུན་དང་། བྲན་ཕོ་བདུན་དང་། བྲན་མོ་བདུན་གྱིས་ང་ལ་མཆོད་པ་བྱས་ཏེ བསྐལ་པ་བྱེ་བ་ཕྲག་སྟོང་དུ་ལོག་པར་ལྟུང་བར་མི་འགྲོ་སྟེ། ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། ། དེ་བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་འདས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེད་དཔོན་ཞེས་བྱ་བ་མཉེས་པར་བྱེད་པར་འགྱུར་རོ། མཉེས་པར་བྱས་ནས་བསྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། རི་མོར་བྱེད་པར་འགྱུར། མཆོད་པར་བྱེད་པར་འགྱུར་ཏེ། དེའི་འོག་ཏུ་བསྐལ་པ་ཉི་ཤུར་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་རོ། །
en: The Lord then replied to the venerable Ānanda, “Ānanda, this merchant’s son Naradatta has paid honor to me accompanied by seven wives, seven sons, seven daughters, seven male servants, and seven female servants, and so he will avoid falling into the lower realms for a billion eons and will be reborn as a god or a human being. After twenty billion eons he will encounter a tathāgata, arhat, fully accomplished Buddha named Sārthavāha. When he meets him, he will praise him, venerate him, honor him, and worship him, and then he will avoid falling into the lower realms for another two hundred million eons.

source: ཀུན་དགའ་བོ་དེ་ལ་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་གྱི་ཆུང་མ་བདུན་དང་། བུ་མོ་བདུན་དང་། བྲན་མོ་བདུན་གང་ཡིན་པ་དག་ནི་འདི་ནས་ཤི་འཕོས་ནས་བུད་མེད་ཀྱི་ལུས་ལས་བསྒྱུར་ཏེ སྐྱེས་པའི་ལུས་ཐོབ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མིས་བྱིན་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་རོ། ། དེ་དག་བསྐལ་པ་གཅིག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: “Ānanda, when the seven wives, seven sons, seven daughters, seven male servants, and seven female servants of the merchant’s son Naradatta die, they will all avoid taking on female forms, and will instead attain the bodies of men. Together with the bodhisatva Naradatta, they will then practice the way of the bodhisatva. They will attain unsurpassed perfect awakening within one eon.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མིས་བྱིན་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེམས་སྙོམས་ཞེས་བྱ་བར་འགྱུར་རོ། ། བྱང་ཆུབ་སེམས་དཔའ་མིས་བྱིན་གྱི་ཞབས་འབྲིང་བ་གང་ཡིན་པ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པ་མིང་ཐ་དད་པར་འགྱུར་རོ། ། རོལ་མོ་མཁན་ལྔ་བརྒྱ་པོ་གང་ཡིན་པ་དེ་དག་ནི་བསྐལ་པ་གྲངས་མེད་པར་ལོག་པར་ལྟུང་བར་མི་འགྲོ་སྟེ། འཁོར་ལོས་སྒྱུར་པའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་སྟོང་བྱེད་པར་བགྲང་བས་སྨྲ་སྟེ། བར་སྐབས་དེར་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་མཉེས་པར་བྱས་ནས་བསྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། རི་མོར་བྱེད་པར་འགྱུར། མཆོད་པ་བྱེད་པར་འགྱུར་རོ། ཐམས་ཅད་ཀྱང་བསྐལ་པ་གཅིག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་འཇམ་ཞེས་བྱ་བར་ཐམས་ཅད་མིང་འཐུན་པར་འགྱུར་རོ། །
en: “Ānanda, the bodhisatva, the great being Naradatta will become a tathāgata, arhat, fully accomplished buddha by the name of Samacitta. The followers of the bodhisatva Naradatta will all become tathāgatas with various different names. The five hundred musicians that are here will avoid falling into the lower realms for innumerable eons, and I proclaim by way of numbers that they will become billions of kings of the entire world. During that time, they will encounter ten thousand buddhas, and they will praise them, venerate them, honor them, and serve them. All of them will attain unsurpassed complete perfect awakening after one eon. They will all become tathāgatas, arhats, fully accomplished buddhas, and they will all be given the same name. They will all be called Mañjusvara.

source: སྲོག་ཆགས་ཁྲི་བོ་དེ་དག་ལས་སྲོག་ཆགས་བཞི་བརྒྱ་ནི་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་མཉེས་པར་བྱས་ནས་དེའི་ཚེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། ། ལྷག་མ་རྣམས་ནི་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ལོག་པར་ལྟུང་བར་མི་འགྲོ་སྟེ། ཚུལ་འདིས་སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་མཉེས་པར་བྱས་ནས་བསྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། རི་མོར་བྱེད་པར་འགྱུར། མཆོད་པ་བྱེད་པར་འགྱུར་རོ། ། ཐམས་ཅད་ཀྱང་བསྐལ་པ་གཅིག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ངོ་མཚར་ཞེས་བྱ་བར་ཐམས་ཅད་ཀྱང་མིང་འཐུན་པར་འགྱུར་རོ། །
en: “Four hundred of the ten thousand beings from the city will meet the Tathāgata Maitreya and will then attain final nirvāṇa. The rest of them will avoid falling into the lower realms for as many eons as there are grains of sand in the river Ganges. In due course, they will encounter a billion buddhas, whom they will praise, venerate, honor, and serve, and they will all reach complete and perfect awakening within a single eon. They will all become tathāgatas, arhats, and fully accomplished buddhas, and they will all be given the same name. They will all be called Āścarya.

source: སྲོག་ཆགས་དྲུག་སྟོང་པོ་དེ་དག་ལས་སྲོག་ཆགས་སྟོང་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། དམ་པའི་ཆོས་ནུབ་ནས་ མཚོན་གྱི་བསྐལ་པ་བར་མ་ནི་འདས་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་ནི་མ་བྱུང་བའི་དུས་ན་དེར་སེམས་ཅན་རྣམས་ཀྱི་ཚེ་འཕེལ་བར་འགྱུར་བའི་དུས་དེ་ན་རང་སངས་རྒྱས་བརྒྱད་ཁྲི་འབྱུང་བར་འགྱུར་ཏེ སྲོག་ཆགས་སྟོང་པོ་དེ་དག་གིས་རང་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་མཉེས་པར་བྱས་ནས་བསྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། རི་མོར་བྱེད་པར་འགྱུར། མཆོད་པར་བྱེད་པར་འགྱུར་རོ། ། གང་ཟག་གི་མཆོག་བྱམས་པ་དེ་ཡང་མཉེས་པར་བྱས་ནས་བསྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། རི་མོར་བྱེད་པར་འགྱུར། མཆོད་པར་བྱེད་པར་འགྱུར་རོ། ། དེའི་འོག་ཏུ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་ཉི་ཤུར་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་རོ། ། དེ་ནས་ལུས་ཀྱི་ཐ་མ་བདག་གི་ལུས་ཀྱི་ཐ་མ་ཐོབ་ནས་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་བསྐུལ་ཏེ། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས། རང་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ། །
en: “After I have attained final nirvāṇa, when the true Dharma has disappeared, when the age of strife has passed, when the tathāgata Maitreya has not yet appeared, when the lifespan of sentient beings increases, and when ten thousand pratyekabuddhas appear, there are one thousand beings among these six thousand beings who will meet these pratyekabuddhas and who will praise them, venerate them, honor them, and serve them. They will meet the supreme man Maitreya, and they will praise him, venerate him, honor him, and serve him. After this they will avoid falling into the lower realms for two hundred thousand million billion eons, and then in their final life, when they attain their final body, impelled by their roots of virtue, they will follow their conviction, leave the household life behind to become renunciants, and realize awakening independently.

source: སྲོག་ཆགས་ཁྲི་པོ་ལས་སྲོག་ཆགས་མཐོང་བ་སྐྱེས་པ་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། ། ལྷའི་བུ་ཁྲི་ཕྲག་དྲུག་ཅུ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པར་སྐྱེས་སོ། །
en: “From among these ten thousand beings, a thousand will reach the insight that is required for the mind of unsurpassed perfect awakening to arise. Six trillion gods will obtain the spotless, pure Dharma-vision of phenomena.

source: ཀུན་དགའ་བོ་བྱིས་པ་རྣམས་མ་གཏོགས་པར་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་སུ་ཞིག་དགའ་བ་དང་། དད་པ་དང་། གུས་པ་དང་། ཞེས་སྐྱེད་པར་མི་བྱེད། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དགེ་བའི་རྩ་བ་ཆུང་ངུས་འདི་ལྟ་བུའི་ཆེ་བ་ཉིད་ཐོབ་ཅིང་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་རེག་གོ །
en: “Ānanda, what are those who do not cultivate love, faith, respect, and reverence for the tathāgatas, if not immature children? Why is this? Even those whose roots of virtue are weak may in fact attain the state of greatness. They can reach nirvāṇa.”

source: སངས་རྒྱས་ལ་ནི་གུས་བྱས་ན། །
en: “Someone who shows reverence for the buddhas

source: འདི་འདྲ་བ་ཡི་དཔལ་འཐོབ་སྟེ། །
en: Will attain this kind of glory.

source: དེ་ཕྱིར་གང་ལ་བྱིན་ནི། །འབྲས་བུ་ཆེ་བའི་སྟོན་ལ་མཆོད། །
en: Therefore, you should venerate the teacher. If you do so, what you give will yield a great result.

source: གང་ཡང་བཞུགས་ལ་མཆོད་པ་དང་། །གང་ཡང་མྱ་ངན་འདས་པ་ཡི། །རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་མཆོད་པ། །དེ་བཞིན་གཤེགས་པར་འགྱུར་བར་མཐོང་། །
en: “If someone venerates those who remain Or venerates those who have reached nirvāṇa, Even by offering something as small as a mustard seed, He will come to see the Tathāgata.

source: གང་ཡང་བཞུགས་ལ་མཆོད་པ་དང་། །གང་ཡང་མྱ་ངན་འདས་པ་ཡི། །རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་མཆོད་པ། །སེམས་ཀྱང་མཉམ་ལ་འབྲས་བུ་མཉམ། །
en: “If someone venerates those who remain Or venerates those who have reached nirvāṇa, Even by offering something as small as a mustard seed, The positive effects of their veneration will match their intentions.

source: མཉམ་པའི་སེམས་སུ་བྱས་ནས་ནི། །གང་ཟག་མཆོག་ལ་མཆོད་བྱེད་པ། །དེ་ཡི་རྣམ་པར་སྨིན་པ་མཉམ། ། མཚུངས་པར་བྱང་ཆུབ་འཚང་ཡང་རྒྱ། །
en: “Maintaining a balanced mind And venerating the supreme man, He will ripen in the same way, And he, too, will attain awakening.

source: བདེ་བར་གཤེགས་པའི་ལམ་བཟུང་སྟེ། །
en: “He seizes the path leading to good fortune

source: ངན་པར་འགྲོ་བའི་ལམ་ཡང་བཅད། །
en: And abandons the path that leads to misery.

source: མྱ་ངན་འདས་པར་འགྲོ་བའི་ལམ། །དེ་ཡང་དེ་ལ་མི་དཀོན་ནོ། །
en: It will not be hard for him to find The path that takes one toward nirvāṇa.

source: སངས་རྒྱས་ཚུལ་ཁྲིམས་དམ་པ་དང་། །སངས་རྒྱས་ཏིང་ངེ་འཛིན་མཆོག་གིས། ། དེ་ཕྱིར་མཆོག་ལ་དད་བྱས་ནས། །དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་འགྱུར། །
en: “The Buddha is supreme because of his morality. The Buddha is supreme because of his concentration. If one has faith in these supreme things, One will attain supreme awakening.

source: མཆོད་པ་དམ་པ་བྱས་ནས་ནི། །མྱུར་དུ་མཆོག་ཏུ་འགྱུར་བ་ཡིན། །
en: “By presenting him with supreme offerings, One will quickly reach the supreme state.

source: ཆོས་ཀྱི་དམ་པ་སྟོན་མཛད་པ། །རྫོགས་པའི་སངས་རྒྱས་མཆོག་ཏུ་འགྱུར། །
en: One will become a supreme perfect buddha And teach the supreme Dharma.

source: མི་གང་མཁས་པ་སངས་རྒྱས་ཀྱི། །ཆོས་ལ་སྟེན་པར་འདོད་པ་དེ། །
en: “Any wise man who wishes to rely On the Dharma of the Buddha

source: འདུན་པ་དྲག་པོ་བསྐྱེད་པར་བྱ། ། མང་དུ་ཐོས་ནས་ཚུལ་བཞིན་ནོ། །
en: Should cultivate a strong motivation And, by means of great learning, strive to avoid superficiality.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། །ཚངས་པ་དབང་བྱེད་གྱུར་ནས་ནི། །ཡོན་ཏན་མང་པོའི་འབྱུང་གནས་དང་། །མྱ་ངན་འདས་པར་ངེས་པར་འགྱུར། །
en: “He will become a king of the entire world, The powerful god Brahmā, A great source of good qualities, And he will reach the certainty of nirvāṇa.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་ཤཱ་རིའི་བུ་དེ་བས་ན་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་འདུན་པ་དྲག་པོ་བསྐྱེད་དེ ཤིན་ཏུ་མཉན་པར་བྱ། བླང་བར་བྱ། གཟུང་བར་བྱ། བཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། གཞན་དག་ལ་བརྗོད་པར་བྱ་གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན་ཏམ་བླངས་སམ། བཟུང་ངམ། ཀུན་ཆུབ་པར་བྱས་སམ། གཞན་དག་ལ་བརྗོད་དམ། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅད་པར་བྱ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ། ། ཚད་མེད་པ་བཞི་དང་མི་འབྲལ་བ་ཡིན་ནོ། ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པ་ཡིན་ནོ། ། བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་རྣམས་སྡུད་པར་བརྩོན་པ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་གང་འདི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་དང་འབྲེལ་ཏོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནོར་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ནང་དུ་བཅུག་གོ ། ཤཱ་རིའི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བསླབས་ནས་ཡང་དག་པར་ཆད་པ་རྗེས་སུ་ཐོབ་བོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་རྗེས་སུ་ཐོབ་བོ། །
en: The Lord then addressed the venerable Śāriputra, “In this way, Śāriputra, sons and daughters of good family who have entered into the Mahāyāna and wish to quickly attain unsurpassed perfect awakening should cultivate a powerful yearning for the cycle of teachings contained here, in The Collected Teachings on the Bodhisatva. They should study it conscientiously, learn it, memorize it, recite it, absorb it, clarify it to others, and teach it in great detail to others. Why should they do this? They should do this because when they have studied it conscientiously, learned it, memorized it, recited it, absorbed it, clarified it to others, and taught it in great detail to others, they will be certain not to be cut off from the Three Jewels. They will not be separated from the four immeasurables. They will be applying themselves to the six perfections, and they will gather sentient beings around them by employing the four methods for bringing people together. Śāriputra, this cycle of teachings contained in The Collected Teachings on the Bodhisatva is the path of awakening. Why? Unsurpassed complete perfect awakening is dependent on the cycle of teachings contained in The Collected Teachings on the Bodhisatva, and moreover, Śāriputra, the wealth of the bodhisatvas is collected within the cycle of teachings contained in The Collected Teachings on the Bodhisatva. Therefore, Śāriputra, I myself trained in the cycle of teachings contained in The Collected Teachings on the Bodhisatva, and that is how I attained the state of being severed from the vices.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཕ་རོལ་ཏུ་སོན་པའོ། ། དེ་བཞིན་གཤེགས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ལ་ངེས་པར་བྱས་པ། དེ་བཞིན་གཤེགས་པ་མཛད་པ་རྒྱུན་མ་བཅད་པ། རྣམ་པ་ཐམས་ཅད་ཀྱིས་ཚད་མེད་པའི་རྗེས་སུ་ཐོབ་པ། དེ་བཞིན་གཤེགས་པས་དཔག་ཏུ་མེད་པ་རྗེས་སུ་ཐོབ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་རྗེས་སུ་ཐོབ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ལ་ཤིན་ཏུ་གནས་པའོ། །
en: “What is it that is perfected in all this? It is the final attainment of unsurpassed perfect awakening. The Tathāgata has successfully applied himself to the practice of all these perfections. This is the uninterrupted activity of tathāgatas. This is the attainment of the immeasurable stage that is brought about by employing all good qualities. This is the Tathāgata’s attainment of the immeasurables. This is the attainment of all the perfections. In this way, one is established in all the perfections.”

source: ལུས་ཀྱི་ལས་དང་རྣམ་སྨིན་གྱིས། །རྣམ་པར་སྨིན་པ་ཤེས་པར་བྱ། །
en: “One should know things from the perspective of actions And from the perspective of the maturation of actions.

source: ལས་མིན་རྣམ་སྨིན་མ་ཡིན་གང་། །དེ་བདེ་དེ་ནི་མྱ་ངན་འདས། །
en: That which is neither action nor ripening Is tranquility; it is nirvāṇa.

source: གང་ལས་ཤེས་པ་མེད་པ་ཡི། །འདུས་བྱས་ཐམས་ཅད་སྡུག་བསྔལ་ཏེ། །
en: “The suffering inherent in all conditioned things Will be found wherever knowledge is absent.

source: དེ་ཕྱིར་ཤེས་པ་བསྐྱེད་པས་ནི། །འདུས་བྱས་ཀུན་ལས་རྣམ་པར་གྲོལ། །
en: Therefore one should cultivate knowledge. This is what brings liberation from all conditioned things.”
